RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1A/include/cy8c6347bzi_bld44.h
/*******************************************************************************
*                                     PASS
*******************************************************************************/

#define PASS_BASE                               0x411F0000UL
#define PASS                                    ((PASS_Type*) PASS_BASE)                                          /* 0x411F0000 */
#define PASS_AREF                               ((PASS_AREF_Type*) &PASS->AREF)                                   /* 0x411F0E00 */

/*******************************************************************************
*                                     I2S
*******************************************************************************/

#define I2S0_BASE                               0x42A10000UL
#define I2S0                                    ((I2S_Type*) I2S0_BASE)                                           /* 0x42A10000 */

/*******************************************************************************
*                                     PDM
*******************************************************************************/

#define PDM0_BASE                               0x42A20000UL
#define PDM0                                    ((PDM_Type*) PDM0_BASE)                                           /* 0x42A20000 */


/* Backward compatibility definitions */
#define CY_SRAM0_BASE                           CY_SRAM_BASE
#define CY_SRAM0_SIZE                           CY_SRAM_SIZE
#define I2S                                     I2S0
#define PDM                                     PDM0

/** \} CY8C6347BZI-BLD44 */

#endif /* _CY8C6347BZI_BLD44_H_ */


/* [] END OF FILE */
